name: "AlexNet2Siamese"
# -----------------------------------------------------------------------------
# ------------------------------------------------------------------ Data Layer
# -----------------------------------------------------------------------------


layer {
  name: "data_1"
#  type: "Data"
  type: "ImageData"
  top: "data_1"
  top: "sim_labels"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 227
    mean_file: "../data/models/alexnet/pretrained/places205CNN_mean.binaryproto"
  }

  image_data_param {
#  data_param {  
#    source: "data/domain_adaptation_data/lmdb/train1"
#    backend: LMDB
    source: "data/domain_adaptation_data/images/triplet_data_train.txt"
    batch_size: 256 
  }
}

layer {
  name: "data_1"
#  type: "Data"
  type: "ImageData"
  top: "data_1"
  top: "sim_labels"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 227
    mean_file: "../data/models/alexnet/pretrained/places205CNN_mean.binaryproto"
  }
  image_data_param {
#  data_param {  
#    source: "data/domain_adaptation_data/lmdb/test1"
#    backend: LMDB
    source: "data/domain_adaptation_data/images/triplet_data_test.txt"
    batch_size: 640 
  }
}

# ----------------------------------------------------------------------- Net 1
# -----------------------------------------------------------------------------
# --------------------------------------------------------- Convolutioal Layers
# -----------------------------------------------------------------------------

# ---------------------------------------------------------------------- Conv 1
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data_1"
  top: "conv1"
  param {
    name: "conv1_w"
    lr_mult: .0001
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .0002
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}

# ---------------------------------------------------------------------- Conv 2

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    name: "conv2_w"
    lr_mult: .0001
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .0002
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}

# ---------------------------------------------------------------------- Conv 3
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    name: "conv3_w"
    lr_mult: .0001
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .0002
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

# ---------------------------------------------------------------------- Conv 4
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    name: "conv4_w"
    lr_mult: .0001
    decay_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: .0002
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}


layer {
  name: "fc8_n"
  type: "InnerProduct"
  bottom: "conv4"
  top: "fc8_n"
  param {
    name: "fc8_n_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc8_n_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

# ------------------------------------------------------------------- Siamese Loss
layer {
  name: "loss"
  type: "TripletLoss"
  bottom: "fc8_n"
  bottom: "sim_labels"
  top: "loss"
  include {
    phase: TRAIN
  }
  triplet_loss_param {
    margin: 1
    losstype: 1
    num_triplets: 2
  }
}
layer {
  name: "loss"
  type: "TripletLoss"
  bottom: "fc8_n"
  bottom: "sim_labels"
  top: "loss"
 include {
    phase: TEST
  }
  triplet_loss_param {
    margin: 1
    losstype: 1
    num_triplets: 1
  }
}
